### Question 1

Question: Calculate the correlation between 'MSFT' and 'IBM' returns from a DataFrame of stock returns.

In [3]:
import pandas as pd

# Assuming 'returns' is a DataFrame containing stock returns
returns = pd.DataFrame({
    'MSFT': [0.05, 0.07, -0.01],
    'IBM': [0.04, 0.02, 0.03]
})

returns

   MSFT   IBM
0  0.05  0.04
1  0.07  0.02
2 -0.01  0.03

In [4]:
# Calculate the correlation between 'MSFT' and 'IBM' returns from a DataFrame of stock returns.
correlation = returns['MSFT'].corr(returns['IBM'])
# Print the correlation result
print(f"Correlation between MSFT and IBM returns: {correlation:.2f}")

Correlation between MSFT and IBM returns: -0.24

### Question 2

Question: Convert the columns `B` and `C` from wide to long format.

In [6]:
df = pd.DataFrame({
'A': {0: 'a', 1: 'b', 2: 'c'},
'B': {0: 1, 1: 3, 2: 5},
'C': {0: 2, 1: 4, 2: 6}
})
df

   A  B  C
0  a  1  2
1  b  3  4
2  c  5  6

In [7]:
# Convert the columns `B` and `C` from wide to long format.
df_long = df.melt(id_vars=['A'], value_vars=['B', 'C'], var_name='variable', value_name='value')
df_long

   A variable  value
0  a        B      1
1  b        B      3
2  c        B      5
3  a        C      2
4  b        C      4
5  c        C      6

### Question 3

Question: Slice the Series to return data from 5th to 15th January.

In [8]:
import pandas as pd
import numpy as np

dates = pd.date_range("2023-01-01", "2023-01-31")
data = pd.Series(np.random.rand(len(dates)), index=dates)
data

2023-01-01    0.034902
2023-01-02    0.537529
2023-01-03    0.980295
2023-01-04    0.068044
2023-01-05    0.364132
2023-01-06    0.431764
2023-01-07    0.824356
2023-01-08    0.454389
2023-01-09    0.045333
2023-01-10    0.384936
2023-01-11    0.336951
2023-01-12    0.064050
2023-01-13    0.613540
2023-01-14    0.403985
2023-01-15    0.325712
2023-01-16    0.403461
2023-01-17    0.776310
2023-01-18    0.422658
2023-01-19    0.003070
2023-01-20    0.793459
2023-01-21    0.079490
2023-01-22    0.388804
2023-01-23    0.298662
2023-01-24    0.334863
2023-01-25    0.071026
2023-01-26    0.527274
2023-01-27    0.935695
2023-01-28    0.970170
2023-01-29    0.590114
2023-01-30    0.004428
2023-01-31    0.450209
Freq: D, dtype: float64

In [9]:
# Slice the Series to return data from 5th to 15th January.
sliced_data = data['2023-01-05':'2023-01-15']
sliced_data

2023-01-05    0.364132
2023-01-06    0.431764
2023-01-07    0.824356
2023-01-08    0.454389
2023-01-09    0.045333
2023-01-10    0.384936
2023-01-11    0.336951
2023-01-12    0.064050
2023-01-13    0.613540
2023-01-14    0.403985
2023-01-15    0.325712
Freq: D, dtype: float64